dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Serial.c
#include "RL78G13_Serial.h"

/*SPS*/

/**
 * Function:        static void RL78G13_SerialSPSWriteSingle
 * (RL78G13_SERIAL_UNIT unit,uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial sps write single.
 *      串行时钟选择寄存器
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  value -     The value.
 */

static void RL78G13_SerialSPSWriteSingle(RL78G13_SERIAL_UNIT unit,uint16_t value)
{
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        SPS0 = value;
    }
    else
    {
        SPS1 = value;
    }
}

/**
 * Function:        static uint16_t RL78G13_SerialSPSReadSingle(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial sps read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSPSReadSingle(RL78G13_SERIAL_UNIT unit)
{
    uint16_t value = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        value = SPS0;
    }
    else
    {
        value = SPS1;
    }
    return value;
}

/**
 * Function:
 *  void RL78G13_SerialSPSWriteAll(RL78G13_SERIAL_UNIT unit,uint16_t fclk0Div, uint16_t fclk1Div)
 *
 * Brief:
 *      Rl 78 g 13 serial sps write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.串行单元号码
 *  fclk0Div -  The fclk 0 div.时钟0的分频系数
 *  fclk1Div -  The fclk 1 div.时钟1的分频系数
 */

void RL78G13_SerialSPSWriteAll(RL78G13_SERIAL_UNIT unit,uint16_t fclk0Div, uint16_t fclk1Div)
{
    fclk0Div &= RL78G13_SERIAL_SPS_FLCK0_MASK;
    fclk1Div &= RL78G13_SERIAL_SPS_FLCK1_MASK;
    uint16_t value = (fclk0Div | fclk1Div);
    RL78G13_SerialSPSWriteSingle(unit,value);
}

/**
 * Function:
 *  void RL78G13_SerialSPSWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask,uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial sps write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialSPSWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask,uint16_t value)
{
    uint16_t regValue = RL78G13_SerialSPSReadSingle(unit);
    regValue &= (~mask);
    value &= mask;
    regValue |= value;
    RL78G13_SerialSPSWriteSingle(unit, regValue);
}

/**
 * Function:        uint16_t RL78G13_SerialSPSReadAll(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial sps read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSPSReadAll(RL78G13_SERIAL_UNIT unit)
{
    return RL78G13_SerialSPSReadSingle(unit);
}

/**
 * Function:        uint16_t RL78G13_SerialSPSReadOne(RL78G13_SERIAL_UNIT unit,uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial sps read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSPSReadOne(RL78G13_SERIAL_UNIT unit,uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSPSReadSingle(unit);
    regValue &= mask;
    return regValue;
}


/*SMR*/

/**
 * Function:
 *  void RL78G13_SerialSMRWriteSingle(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial smr write single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.单元号
 *  channel -   The channel.通道号
 *  value -     The value.值
 */

static void RL78G13_SerialSMRWriteSingle(RL78G13_SERIAL_UNIT unit,
    RK78G13_SERIAL_UNIT_CHANNEL channel, uint16_t value)
{
    /*0020是初始化值,必须要设置*/
    value |= 0x0020U;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            SMR00 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            SMR01 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            SMR02 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            SMR03 = value;
            break;
        }
    }
    else
    {
        switch (channel)
        {
            case RK78G13_SERIAL_UNIT_CHANNEL_0:
                SMR10 = value;
                break;
            case RK78G13_SERIAL_UNIT_CHANNEL_1:
                SMR11 = value;
                break;
            case RK78G13_SERIAL_UNIT_CHANNEL_2:
                //SMR12 = value;
                break;
            case RK78G13_SERIAL_UNIT_CHANNEL_3:
                //SMR13 = value;
                break;
        }
    }
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSMRReadSingle(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 serial smr read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSMRReadSingle(RL78G13_SERIAL_UNIT unit,
    RK78G13_SERIAL_UNIT_CHANNEL channel)
{
    uint16_t value = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            value = SMR00;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            value = SMR01;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            value = SMR02;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            value = SMR03;
            break;
        }
    }
    else
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            value = SMR10;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            value = SMR11;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            //value = SMR12;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            //value = SMR13;
            break;
        }
    }
    return value;
}

/**
 * Function:
 *  void RL78G13_SerialSMRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
 *  uint16_t FMCKSelect,uint16_t FTCLKSelect,uint16_t startTrigSourceSelect,
 *  uint16_t uartRecvStartLevel, uint16_t channelMode,uint16_t intSrcSelect)
 *
 * Brief:
 *      Rl 78 g 13 serial smr write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -                      The unit.单元号
 *  channel -                   The channel.通道号
 *  FMCKSelect -                The fmck select.FMCK的来源选择
 *  FTCLKSelect -               The ftclk select.FTCLK的来源选择
 *  startTrigSourceSelect -     The start trig source select.触发开始信号选择
 *  uartRecvStartLevel -        The uart receive start level.接收开始电平选择
 *  channelMode -               The channel mode.通道模式
 *  intSrcSelect -              The int source select.中断源选择
 */

