dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Serial.c
void RL78G13_SerialSMRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t FMCKSelect,uint16_t FTCLKSelect,uint16_t startTrigSourceSelect,uint16_t uartRecvStartLevel,
    uint16_t channelMode,uint16_t intSrcSelect)
{
    FMCKSelect &= RL78G13_SERIAL_SMR_FMCK_SELECT_MASK;
    FTCLKSelect &= RL78G13_SERIAL_SMR_FTCLK_SELECT_MASK;
    startTrigSourceSelect &= RL78G13_SERIAL_SMR_START_TRIG_SOURCE_MASK;
    uartRecvStartLevel &= RL78G13_SERIAL_SMR_UART_RECV_START_LEVEL_MASK;
    channelMode &= RL78G13_SERIAL_SMR_CHANNEL_MODE_MASK;
    intSrcSelect &= RL78G13_SERIAL_SMR_INT_SRC_MASK;
    uint16_t value = (FMCKSelect | FTCLKSelect | startTrigSourceSelect |
        uartRecvStartLevel | channelMode | intSrcSelect);
    RL78G13_SerialSMRWriteSingle(unit,channel,value);
}

/**
 * Function:
 *  void RL78G13_SerialSMRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
 *  uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial smr write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialSMRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_SerialSMRReadSingle(unit, channel);
    regValue &= (~mask);
    regValue |= value;
    RL78G13_SerialSMRWriteSingle(unit, channel,regValue);
}

/**
 * Function:
 *  uint16_t RL78G13_SerialReadAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 serial read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialReadAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel)
{
    return RL78G13_SerialSMRReadSingle(unit,channel);
}

/**
 * Function:
 *  uint16_t RL78G13_SerialReadOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
 *  uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  mask -      The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialReadOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSMRReadSingle(unit, channel);
    regValue &= mask;
    return regValue;
}


/*SCR*/

/**
 * Function:
 *  void RL78G13_SerialSCRWriteSingle(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial screen write single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  value -     The value.
 */

static void RL78G13_SerialSCRWriteSingle(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t value)
{
    value |= 0x0004U;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            SCR00 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            SCR01 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            SCR02 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            SCR03 = value;
            break;
        }
    }
    else
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            SCR10 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            SCR11 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            //SCR12 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            //SCR13 = value;
            break;
        }
    }
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSCRReadSingle(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 serial screen read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSCRReadSingle(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel)
{
    uint16_t regValue = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            regValue = SCR00;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            regValue = SCR01;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            regValue = SCR02;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            regValue = SCR03;
            break;
        }
    }
    else
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            regValue = SCR10;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            regValue = SCR11;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            //regValue = SCR12;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            //regValue = SCR13;
            break;
        }
    }
    return regValue;
}

/**
 * Function:
 *  void RL78G13_SerialSCRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
 *  uint16_t txrxMode,uint16_t csiSingalType,uint16_t errorShield,uint16_t txrxCheckMode,
 *  uint16_t firstBitSet,uint16_t stopBitsSet,uint16_t dataLengthSet)
 *
 * Brief:
 *      Rl 78 g 13 serial screen write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -              The unit.单元号
 *  channel -           The channel.通道号
 *  txrxMode -          The txrx mode.发送接收模式选择
 *  csiSingalType -     Type of the csi singal.信号类型选择
 *  errorShield -       The error shield.错误屏蔽
 *  txrxCheckMode -     The txrx check mode.奇偶校验模式设定
 *  firstBitSet -       Set the first bit belongs to.优先传送BIT设定
 *  stopBitsSet -       Set the stop bits belongs to.停止位设定
 *  dataLengthSet -     Set the data length belongs to.数据长度设定
 */

void RL78G13_SerialSCRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t txrxMode,uint16_t csiSingalType,uint16_t errorShield,uint16_t txrxCheckMode,
    uint16_t firstBitSet,uint16_t stopBitsSet,uint16_t dataLengthSet)
{
    txrxMode &= RL78G13_SERIAL_SCR_MODE_MASK;
    csiSingalType &= RL78G13_SERIAL_SCR_CSI_SINGLE_TYPE_MASK;
    errorShield &= RL78G13_SERIAL_SCR_INT_DISABLE_MASK;
    txrxCheckMode &= RL78G13_SERIAL_SCR_UART_CHECK_MASK;
    firstBitSet &= RL78G13_SERIAL_SCR_UART_CSI_SEQ_MASK;
    stopBitsSet &= RL78G13_SERIAL_SCR_UART_STOP_BITS_MASK;
    dataLengthSet &= RL78G13_SERIAL_SCR_UART_CSI_DATALENGTH_MASK;
    uint16_t regValue = (txrxMode | csiSingalType | errorShield | txrxCheckMode
        |firstBitSet | stopBitsSet | dataLengthSet);
    RL78G13_SerialSCRWriteSingle(unit, channel, regValue);
}

/**
 * Function:
 *  void RL78G13_SerialSCRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
 *  uint16_t mask,uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial screen write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialSCRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask,uint16_t value)
{
    uint16_t regValue = RL78G13_SerialSCRReadSingle(unit, channel);
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_SerialSCRWriteSingle(unit, channel,regValue);
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSCRReadAll(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 serial screen read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSCRReadAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel)
{
    return RL78G13_SerialSCRReadSingle(unit,channel);
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSCRReadOne(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial screen read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  mask -      The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSCRReadOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSCRReadSingle(unit, channel);
    regValue &= mask;
    return regValue;
}


/*SDR*/

/**
 * Function:
 *  void RL78G13_SerialSDRWriteSingle(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial sdr write single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  value -     The value.
 */

static void RL78G13_SerialSDRWriteSingle(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t value)
{
    value &= (~0X0100U);
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            SDR00 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            SDR01 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            SDR02 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            SDR03 = value;
            break;
        }
    }
    else
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            SDR10 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            SDR11 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            //SDR12 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            //SDR13 = value;
            break;
        }
    }
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSDRReadSingle(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 serial sdr read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSDRReadSingle(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel)
{
    uint16_t regValue = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            regValue = SDR00;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            regValue = SDR01;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            regValue = SDR02;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            regValue = SDR03;
            break;
        }
    }
    else
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            regValue = SDR10;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            regValue = SDR11;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            //regValue = SDR12;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            //regValue = SDR13;
            break;
        }
    }
    return regValue;
}

/**
 * Function:
 *  void RL78G13_SerialSDRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
 *  uint16_t fmclkDiv,uint16_t sendData)
 *
 * Brief:
 *      Rl 78 g 13 serial sdr write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.单元号
 *  channel -   The channel.通道号
 *  fmclkDiv -  The fmclk div.从FMCLK分频系数
 *  sendData -  Information describing the send.发送数据
 */

void RL78G13_SerialSDRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t fmclkDiv,uint16_t sendData)
{
    fmclkDiv &= RL78G13_SERIAL_SDR_FMCK_DIV_MASK;
    sendData &= RL78G13_SERIAL_SDR_DATA_MASK;
    uint16_t regValue = (fmclkDiv | sendData);
    RL78G13_SerialSDRWriteSingle(unit, channel, regValue);
}

/**
 * Function:
 *  void RL78G13_SerialSDRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
 *  uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial sdr write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  mask -      The mask.
 *  value -     The value.
 */

