dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Serial.c
void RL78G13_SerialSDRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_SerialSDRReadSingle(unit, channel);
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_SerialSDRWriteSingle(unit, channel, regValue);
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSDRReadAll(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 serial sdr read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSDRReadAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel)
{
    return RL78G13_SerialSDRReadSingle(unit, channel);
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSDRReadOne(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial sdr read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  mask -      The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSDRReadOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSDRReadSingle(unit, channel);
    regValue &= mask;
    return regValue;
}



/*SIR*/

/**
 * Function:
 *  void RL78G13_SerialSIRWriteSingle(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial sir write single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  value -     The value.
 */

static void RL78G13_SerialSIRWriteSingle(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t value)
{
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            SIR00 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            SIR01 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            SIR02 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            SIR03 = value;
            break;
        }
    }
    else
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            SIR10 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            SIR11 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            //SIR12 = value;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            //SIR13 = value;
            break;
        }
    }
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSIRReadSingle(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 serial sir read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSIRReadSingle(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel)
{
    uint16_t regValue = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            regValue = SIR00;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            regValue = SIR01;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            regValue = SIR02;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            regValue = SIR03;
            break;
        }
    }
    else
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            regValue = SIR10;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            regValue = SIR11;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            //regValue = SIR12;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            //regValue = SIR13;
            break;
        }
    }
    return regValue;
}

/**
 * Function:
 *  void RL78G13_SerialSIRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
 *  uint16_t frameErrClear,uint16_t checkErrClear,uint16_t overFlowErrClear)
 *
 * Brief:
 *      Rl 78 g 13 serial sir write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -              The unit.单元号
 *  channel -           The channel.通道号码
 *  frameErrClear -     The frame error clear.清除帧错误
 *  checkErrClear -     The check error clear.清除就校验错误或者ACK错误
 *  overFlowErrClear -  The over flow error clear.缓存溢出错误
 */

void RL78G13_SerialSIRWriteAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t frameErrClear,uint16_t checkErrClear,uint16_t overFlowErrClear)
{
    frameErrClear &= RL78G13_SERIAL_SIR_FECT_MASK;
    checkErrClear &= RL78G13_SERIAL_SIR_PECT_MASK;
    overFlowErrClear &= RL78G13_SERIAL_SIR_OVCT_MASK;
    uint16_t regValue = (frameErrClear| checkErrClear| overFlowErrClear);
    RL78G13_SerialSIRWriteSingle(unit, channel, regValue);
}

/**
 * Function:
 *  void RL78G13_SerialSIRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
 *  uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial sir write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialSIRWriteOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_SerialSIRReadSingle(unit, channel);
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_SerialSIRWriteSingle(unit, channel, regValue);
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSIRReadAll(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 serial sir read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

