dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Serial.c
uint16_t RL78G13_SerialSIRReadAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel)
{
    return RL78G13_SerialSIRReadSingle(unit, channel);
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSIRReadOne(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial sir read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  mask -      The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSIRReadOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSIRReadSingle(unit, channel);
    regValue &= mask;
    return regValue;
}


/*SSR*/

/**
 * Function:
 *  uint16_t RL78G13_SerialSSRReadSingle(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 serial ssr read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSSRReadSingle(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel)
{
    uint16_t regValue = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            regValue = SSR00;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            regValue = SSR01;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            regValue = SSR02;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            regValue = SSR03;
            break;
        }
    }
    else
    {
        switch (channel)
        {
        case RK78G13_SERIAL_UNIT_CHANNEL_0:
            regValue = SSR10;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_1:
            regValue = SSR11;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_2:
            //regValue = SSR12;
            break;
        case RK78G13_SERIAL_UNIT_CHANNEL_3:
            //regValue = SSR13;
            break;
        }
    }
    return regValue;
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSSRReadAll(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 serial ssr read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSSRReadAll(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel)
{
    return RL78G13_SerialSSRReadSingle(unit, channel);
}

/**
 * Function:
 *  uint16_t RL78G13_SerialSSRReadOne(RL78G13_SERIAL_UNIT unit,
 *  RK78G13_SERIAL_UNIT_CHANNEL channel, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial ssr read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  channel -   The channel.
 *  mask -      The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSSRReadOne(RL78G13_SERIAL_UNIT unit, RK78G13_SERIAL_UNIT_CHANNEL channel,
    uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSSRReadSingle(unit, channel);
    regValue &= mask;
    return regValue;
}


/*SS*/

/**
 * Function:        void RL78G13_SerialSSWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial ss write single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  value -     The value.
 */

static void RL78G13_SerialSSWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
{
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        SS0 = value;
    }
    else
    {
        SS1 = value;
    }
}

/**
 * Function:        uint16_t RL78G13_SerialSSReadSingle(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial ss read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSSReadSingle(RL78G13_SERIAL_UNIT unit)
{
    uint16_t regValue = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        regValue = SS0;
    }
    else
    {
        regValue = SS1;
    }
    return regValue;
}

/**
 * Function:
 *  void RL78G13_SerialSSWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t com0Wait, uint16_t com1Wait,
 *  uint16_t com2Wait, uint16_t com3Wait)
 *
 * Brief:
 *      Rl 78 g 13 serial ss write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  com0Wait -  The com 0 wait.设定通讯口0开始操作,等待操作
 *  com1Wait -  The com 1 wait.设定通讯口1开始操作,等待操作
 *  com2Wait -  The com 2 wait.设定通讯口2开始操作,等待操作
 *  com3Wait -  The com 3 wait.设定通讯口3开始操作,等待操作
 */

void RL78G13_SerialSSWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t com0Wait, uint16_t com1Wait,
    uint16_t com2Wait, uint16_t com3Wait)
{
    com0Wait &= RL78G13_SERIAL_SS_COM0_WAIT_FLAG_MASK;
    com1Wait &= RL78G13_SERIAL_SS_COM1_WAIT_FLAG_MASK;
    com2Wait &= RL78G13_SERIAL_SS_COM2_WAIT_FLAG_MASK;
    com3Wait &= RL78G13_SERIAL_SS_COM3_WAIT_FLAG_MASK;
    uint16_t regValue = (com0Wait|com1Wait|com1Wait|com2Wait);
    RL78G13_SerialSSWriteSingle(unit, regValue);
}

/**
 * Function:
 *  void RL78G13_SerialSSWriteOne(RL78G13_SERIAL_UNIT unit,uint16_t mask,uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial ss write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialSSWriteOne(RL78G13_SERIAL_UNIT unit,uint16_t mask,uint16_t value)
{
    uint16_t regValue = RL78G13_SerialSSReadSingle(unit);
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_SerialSSWriteSingle(unit, regValue);
}

/**
 * Function:        uint16_t RL78G13_SerialSSReadAll(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial ss read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSSReadAll(RL78G13_SERIAL_UNIT unit)
{
    return RL78G13_SerialSSReadSingle(unit);
}

/**
 * Function:        uint16_t RL78G13_SerialSSReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial ss read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSSReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSSReadSingle(unit);
    regValue &= mask;
    return regValue;
}


