dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Serial.c
/*ST*/

/**
 * Function:        void RL78G13_SerialSTWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial st write single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  value -     The value.
 */

static void RL78G13_SerialSTWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
{
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        ST0 = value;
    }
    else
    {
        ST1 = value;
    }
}

/**
 * Function:        uint16_t RL78G13_SerialSTReadSingle(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial st read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSTReadSingle(RL78G13_SERIAL_UNIT unit)
{
    uint16_t regValue = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        regValue = ST0;
    }
    else
    {
        regValue = ST1;
    }
    return regValue;
}

/**
 * Function:
 *  void RL78G13_SerialSTWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t com0Stop, uint16_t com1Stop,
 *  uint16_t com2Stop, uint16_t com3Stop)
 *
 * Brief:
 *      Rl 78 g 13 serial st write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.单元号
 *  com0Stop -  The com 0 stop.设定通讯口0停止操作,不在传输
 *  com1Stop -  The com 1 stop.设定通讯口1停止操作,不在传输
 *  com2Stop -  The com 2 stop.设定通讯口2停止操作,不在传输
 *  com3Stop -  The com 3 stop.设定通讯口3停止操作,不在传输
 */

void RL78G13_SerialSTWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t com0Stop, uint16_t com1Stop,
    uint16_t com2Stop, uint16_t com3Stop)
{
    com0Stop &= RL78G13_SERIAL_ST_COM0_STOP_FLAG_MASK;
    com1Stop &= RL78G13_SERIAL_ST_COM1_STOP_FLAG_MASK;
    com2Stop &= RL78G13_SERIAL_ST_COM2_STOP_FLAG_MASK;
    com3Stop &= RL78G13_SERIAL_ST_COM3_STOP_FLAG_MASK;
    uint16_t regValue = (com0Stop|com1Stop|com2Stop|com3Stop);
    RL78G13_SerialSTWriteSingle(unit, regValue);
}

/**
 * Function:
 *  void RL78G13_SerialSTWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial st write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialSTWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_SerialSTReadSingle(unit);
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_SerialSTWriteSingle(unit, regValue);
}

/**
 * Function:        uint16_t RL78G13_SerialSTReadAll(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial st read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSTReadAll(RL78G13_SERIAL_UNIT unit)
{
    return RL78G13_SerialSTReadSingle(unit);
}

/**
 * Function:        uint16_t RL78G13_SerialSTReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial st read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSTReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSTReadSingle(unit);
    regValue &= mask;
    return regValue;
}


/*SE*/

/**
 * Function:        uint16_t RL78G13_SerialSEReadSingle(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial se read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSEReadSingle(RL78G13_SERIAL_UNIT unit)
{
    uint16_t regValue = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        regValue = SE0;
    }
    else
    {
        regValue = SE1;
    }
    return regValue;
}

/**
 * Function:        uint16_t RL78G13_SerialSEReadAll(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial se read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSEReadAll(RL78G13_SERIAL_UNIT unit)
{
    return RL78G13_SerialSEReadSingle(unit);
}

/**
 * Function:        uint16_t RL78G13_SerialSEReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial se read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSEReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSEReadSingle(unit);
    regValue &= mask;
    return regValue;
}


/*SOE*/

/**
 * Function:        void RL78G13_SerialSOEWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial soe write single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  value -     The value.
 */

static void RL78G13_SerialSOEWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
{
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        SOE0 = value;
    }
    else
    {
        SOE1 = value;
    }
}

/**
 * Function:        uint16_t RL78G13_SerialSOEReadSingle(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial soe read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSOEReadSingle(RL78G13_SERIAL_UNIT unit)
{
    uint16_t regValue = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        regValue = SOE0;
    }
    else
    {
        regValue = SOE1;
    }
    return regValue;
}

/**
 * Function:
 *  void RL78G13_SerialSOEWriteAll(RL78G13_SERIAL_UNIT unit,uint16_t com0AllowOP,
 *  uint16_t com1AllowOP, uint16_t com2AllowOP, uint16_t com3AllowOP)
 *
 * Brief:
 *      Rl 78 g 13 serial soe write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -          The unit.
 *  com0AllowOP -   The com 0 allow operation.通讯口0允许操作
 *  com1AllowOP -   The com 1 allow operation.通讯口1允许操作
 *  com2AllowOP -   The com 2 allow operation.通讯口2允许操作
 *  com3AllowOP -   The com 3 allow operation.通讯口3允许操作
 */

