dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Serial.c
void RL78G13_SerialSOEWriteAll(RL78G13_SERIAL_UNIT unit,uint16_t com0AllowOP,
    uint16_t com1AllowOP, uint16_t com2AllowOP, uint16_t com3AllowOP)
{
    com0AllowOP &= RL78G13_SERIAL_SOE_COM0_OUTPUT_ENABLE_FLAG_MASK;
    com1AllowOP &= RL78G13_SERIAL_SOE_COM1_OUTPUT_ENABLE_FLAG_MASK;
    com2AllowOP &= RL78G13_SERIAL_SOE_COM2_OUTPUT_ENABLE_FLAG_MASK;
    com3AllowOP &= RL78G13_SERIAL_SOE_COM3_OUTPUT_ENABLE_FLAG_MASK;
    uint16_t regValue = (com0AllowOP| com1AllowOP| com2AllowOP| com3AllowOP);
    RL78G13_SerialSOEWriteSingle(unit, regValue);
}

/**
 * Function:
 *  void RL78G13_SerialSOEWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial soe write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialSOEWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_SerialSOEReadSingle(unit);
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_SerialSOEWriteSingle(unit, regValue);
}

/**
 * Function:        uint16_t RL78G13_SerialSOEReadAll(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial soe read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSOEReadAll(RL78G13_SERIAL_UNIT unit)
{
    return RL78G13_SerialSOEReadSingle(unit);
}

/**
 * Function:        uint16_t RL78G13_SerialSOEReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial soe read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSOEReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSOEReadSingle(unit);
    regValue &= mask;
    return regValue;
}


/*SO*/

/**
 * Function:        void RL78G13_SerialSOWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial so write single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  value -     The value.
 */

static void RL78G13_SerialSOWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
{
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        SO0 = value;
    }
    else
    {
        SO1 = value;
    }
}

/**
 * Function:        uint16_t RL78G13_SerialSOReadSingle(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial so read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSOReadSingle(RL78G13_SERIAL_UNIT unit)
{
    uint16_t regValue = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        regValue = SO0;
    }
    else
    {
        regValue = SO1;
    }
    return regValue;
}

/**
 * Function:
 *  void RL78G13_SerialSOWriteAll(RL78G13_SERIAL_UNIT unit,uint16_t clock0OutValue,
 *  uint16_t clock1OutValue, uint16_t clock2OutValue, uint16_t clock3OutValue,
 *  uint16_t data0OutValue, uint16_t data1OutValue, uint16_t data2OutValue,
 *  uint16_t data3OutValue)
 *
 * Brief:
 *      Rl 78 g 13 serial so write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -              The unit.
 *  clock0OutValue -    The clock 0 out value.端口0时钟引脚输出电平
 *  clock1OutValue -    The clock 1 out value.端口1时钟引脚输出电平
 *  clock2OutValue -    The clock 2 out value.端口2时钟引脚输出电平
 *  clock3OutValue -    The clock 3 out value.端口3时钟引脚输出电平
 *  data0OutValue -     The data 0 out value.端口0数据引脚输出电平
 *  data1OutValue -     The data 1 out value.端口1数据引脚输出电平
 *  data2OutValue -     The data 2 out value.端口2数据引脚输出电平
 *  data3OutValue -     The data 3 out value.端口3数据引脚输出电平
 */

void RL78G13_SerialSOWriteAll(RL78G13_SERIAL_UNIT unit,uint16_t clock0OutValue,
    uint16_t clock1OutValue, uint16_t clock2OutValue, uint16_t clock3OutValue,
    uint16_t data0OutValue, uint16_t data1OutValue, uint16_t data2OutValue,
    uint16_t data3OutValue)
{
    clock0OutValue &= RL78G13_SERIAL_SO_COM0_CLOCK_OUTPUT_MASK;
    clock1OutValue &= RL78G13_SERIAL_SO_COM1_CLOCK_OUTPUT_MASK;
    clock2OutValue &= RL78G13_SERIAL_SO_COM2_CLOCK_OUTPUT_MASK;
    clock3OutValue &= RL78G13_SERIAL_SO_COM3_CLOCK_OUTPUT_MASK;

    data0OutValue &= RL78G13_SERIAL_SO_COM0_DATA_OUTPUT_MASK;
    data1OutValue &= RL78G13_SERIAL_SO_COM1_DATA_OUTPUT_MASK;
    data2OutValue &= RL78G13_SERIAL_SO_COM2_DATA_OUTPUT_MASK;
    data3OutValue &= RL78G13_SERIAL_SO_COM3_DATA_OUTPUT_MASK;

    uint16_t regValue = (clock0OutValue| clock1OutValue| clock2OutValue| clock3OutValue
        | data0OutValue| data1OutValue| data2OutValue| data3OutValue);
    RL78G13_SerialSOWriteSingle(unit, regValue);
}

/**
 * Function:
 *  void RL78G13_SerialSOWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial so write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialSOWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_SerialSOReadSingle(unit);
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_SerialSOWriteSingle(unit, regValue);
}

/**
 * Function:        uint16_t RL78G13_SerialSOReadAll(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial so read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSOReadAll(RL78G13_SERIAL_UNIT unit)
{
    return RL78G13_SerialSOReadSingle(unit);
}

/**
 * Function:        uint16_t RL78G13_SerialSOReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial so read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSOReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSOReadSingle(unit);
    regValue &= mask;
    return regValue;
}


/*SOL*/

/**
 * Function:        void RL78G13_SerialSOLWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial sol write single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  value -     The value.
 */

static void RL78G13_SerialSOLWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
{
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        SOL0 = value;
    }
    else
    {
        SOL1 = value;
    }
}

/**
 * Function:        uint16_t RL78G13_SerialSOLReadSingle(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial sol read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSOLReadSingle(RL78G13_SERIAL_UNIT unit)
{
    uint16_t regValue = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        regValue = SOL0;
    }
    else
    {
        regValue = SOL1;
    }
    return regValue;
}

/**
 * Function:
 *  void RL78G13_SerialSOLWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t tx0LevelReserve,
 *  uint16_t tx2LevelReserve)
 *
 * Brief:
 *      Rl 78 g 13 serial sol write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -              The unit.
 *  tx0LevelReserve -   The transmit 0 level reserve.发送口0传输信号反向
 *  tx2LevelReserve -   The transmit 2 level reserve.传输口1传输信号反向
 */

void RL78G13_SerialSOLWriteAll(RL78G13_SERIAL_UNIT unit, uint16_t tx0LevelReserve,
    uint16_t tx2LevelReserve)
{
    tx0LevelReserve &= RL78G13_SERIAL_SOL_COM0_OUTPUT_REVERSE_FLAG_MASK;
    tx2LevelReserve &= RL78G13_SERIAL_SOL_COM2_OUTPUT_REVERSE_FLAG_MASK;
    uint16_t regValue = (tx0LevelReserve | tx2LevelReserve);
    RL78G13_SerialSOLWriteSingle(unit, regValue);
}

/**
 * Function:
 *  void RL78G13_SerialSOLWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial sol write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialSOLWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_SerialSOLReadSingle(unit);
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_SerialSOLWriteSingle(unit, regValue);
}

/**
 * Function:        uint16_t RL78G13_SerialSOLReadAll(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial sol read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSOLReadAll(RL78G13_SERIAL_UNIT unit)
{
    return RL78G13_SerialSOLReadSingle(unit);
}

/**
 * Function:        uint16_t RL78G13_SerialSOLReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial sol read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSOLReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSOLReadSingle(unit);
    regValue &= mask;
    return regValue;
}


