dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Serial.c
/*SSC*/

/**
 * Function:        void RL78G13_SerialSSCWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial ssc write single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  value -     The value.
 */

static void RL78G13_SerialSSCWriteSingle(RL78G13_SERIAL_UNIT unit, uint16_t value)
{
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        SSC0 = value;
    }
    else
    {
        //SSC1 = value;
    }
}

/**
 * Function:        uint16_t RL78G13_SerialSSCReadSingle(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial ssc read single.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_SerialSSCReadSingle(RL78G13_SERIAL_UNIT unit)
{
    uint16_t regValue = 0;
    if (unit == RL78G13_SERIAL_UNIT_0)
    {
        regValue = SSC0;
    }
    else
    {
        //regValue = SSC1;
    }
    return regValue;
}

/**
 * Function:
 *  void RL78G13_SerialSSCWriteAll(RL78G13_SERIAL_UNIT unit,uint16_t errIntEnable,
 *  uint16_t snoozeEnable)
 *
 * Brief:
 *      Rl 78 g 13 serial ssc write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -          The unit.
 *  errIntEnable -  The error int enable.错误唤醒使能
 *  snoozeEnable -  The snooze enable.SNOOZE模式使能
 */

void RL78G13_SerialSSCWriteAll(RL78G13_SERIAL_UNIT unit,uint16_t errIntEnable,
    uint16_t snoozeEnable)
{
    errIntEnable &= RL78G13_SERIAL_SSC_INT_ERR_ENABLE_MASK;
    snoozeEnable &= RL78G13_SERIAL_SSC_SNOOZE_ENABLE_MASK;
    uint16_t regValue = (errIntEnable| snoozeEnable);
    RL78G13_SerialSSCWriteSingle(unit, regValue);
}

/**
 * Function:
 *  void RL78G13_SerialSSCWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial ssc write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -      The unit.
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialSSCWriteOne(RL78G13_SERIAL_UNIT unit, uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_SerialSSCReadSingle(unit);
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_SerialSSCWriteSingle(unit, regValue);
}

/**
 * Function:        uint16_t RL78G13_SerialSSCReadAll(RL78G13_SERIAL_UNIT unit)
 *
 * Brief:
 *      Rl 78 g 13 serial ssc read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSSCReadAll(RL78G13_SERIAL_UNIT unit)
{
    return RL78G13_SerialSSCReadSingle(unit);
}

/**
 * Function:        uint16_t RL78G13_SerialSSCReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial ssc read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  unit -  The unit.
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialSSCReadOne(RL78G13_SERIAL_UNIT unit, uint16_t mask)
{
    uint16_t regValue = RL78G13_SerialSSCReadSingle(unit);
    regValue &= mask;
    return regValue;
}


/*ISC*/

/**
 * Function:        void RL78G13_SerialISCWriteAll(uint8_t timer7Switch,uint8_t intp0Switch)
 *
 * Brief:
 *      Rl 78 g 13 serial isc write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  timer7Switch -  The timer 7 switch.TIMER7引脚切换
 *  intp0Switch -   The intp 0 switch.intp0引脚切换
 */

void RL78G13_SerialISCWriteAll(uint8_t timer7Switch,uint8_t intp0Switch)
{
    timer7Switch &= RL78G13_SERIAL_ISC_TIMER7_INPUT_MASK;
    intp0Switch &= RL78G13_SERIAL_ISC_INTP0_INPUT_MASK;
    uint8_t regValue = (timer7Switch| intp0Switch);
    ISC = regValue;
}

/**
 * Function:        void RL78G13_SerialISCWriteOne(uint16_t mask, uint8_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial isc write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialISCWriteOne(uint16_t mask, uint8_t value)
{
    uint8_t regValue = ISC;
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    ISC = regValue;
}

/**
 * Function:        uint8_t RL78G13_SerialISCReadAll(void)
 *
 * Brief:
 *      Rl 78 g 13 serial isc read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Returns:
 *      An uint8_t.
 */

uint8_t RL78G13_SerialISCReadAll(void)
{
    uint8_t regValue = ISC;
    return regValue;
}

/**
 * Function:        uint8_t RL78G13_SerialISCReadOne(uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial isc read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  mask -  The mask.
 *
 * Returns:
 *      An uint8_t.
 */

uint8_t RL78G13_SerialISCReadOne(uint16_t mask)
{
    uint8_t regValue = ISC;
    regValue &= mask;
    return regValue;
}


/*NFEN*/

/**
 * Function:
 *  void RL78G13_SerialNFENWriteAll(uint8_t rxd0FilterEnable, uint8_t rxd1FilterEnable,
 *  uint8_t rxd2FilterEnable, uint8_t rxd3FilterEnable)
 *
 * Brief:
 *      Rl 78 g 13 serial nfen write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  rxd0FilterEnable -  The receive data 0 filter enable.输入0的引脚滤波器开关
 *  rxd1FilterEnable -  The receive data 1 filter enable.输入1的引脚滤波器开关
 *  rxd2FilterEnable -  The receive data 2 filter enable.输入2的引脚滤波器开关
 *  rxd3FilterEnable -  The receive data 3 filter enable.输入3的引脚滤波器开关
 */

void RL78G13_SerialNFENWriteAll(uint8_t rxd0FilterEnable, uint8_t rxd1FilterEnable,
    uint8_t rxd2FilterEnable, uint8_t rxd3FilterEnable)
{
    rxd0FilterEnable &= RL78G13_SERIAL_NFEN_RXD0_NOIZE_FILTER_MASK;
    rxd1FilterEnable &= RL78G13_SERIAL_NFEN_RXD1_NOIZE_FILTER_MASK;
    rxd2FilterEnable &= RL78G13_SERIAL_NFEN_RXD2_NOIZE_FILTER_MASK;
    rxd3FilterEnable &= RL78G13_SERIAL_NFEN_RXD3_NOIZE_FILTER_MASK;
    uint8_t regValue = (rxd0FilterEnable| rxd1FilterEnable| rxd2FilterEnable| rxd3FilterEnable);
    NFEN0 = regValue;
}

/**
 * Function:        void RL78G13_SerialNFENWriteOne(uint16_t mask, uint8_t value)
 *
 * Brief:
 *      Rl 78 g 13 serial nfen write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_SerialNFENWriteOne(uint16_t mask, uint8_t value)
{
    uint8_t regValue = NFEN0;
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    NFEN0 = regValue;
}

/**
 * Function:        uint16_t RL78G13_SerialNFENReadAll()
 *
 * Brief:
 *      Rl 78 g 13 serial nfen read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialNFENReadAll()
{
    uint8_t regValue = NFEN0;
    return regValue;
}

/**
 * Function:        uint16_t RL78G13_SerialNFENReadOne(uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 serial nfen read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/24
 *
 * Param:
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_SerialNFENReadOne(uint16_t mask)
{
    uint8_t regValue = NFEN0;
    regValue &= mask;
    return regValue;
}


